app/Controllers/Auth.php

        if ($users['role'] == 'anggota') {

            // cek apakah anggota sudah ada
            $anggota = $db->table('anggota')
                ->where('user_id', $users['id'])
                ->get()
                ->getRowArray();
---
SELECT *
FROM `anggota`
WHERE `user_id` = '3'