app/Controllers/Buku.php


        // =========================
        // 4. INSERT RAK
        // =========================
        $this->db->table('buku_rak')->insert([
            'id_buku' => $id_buku,
            'id_rak'  => $data['id_rak']
        ]);
---
INSERT INTO `buku_rak` (`id_buku`, `id_rak`) VALUES (53, '7')


        $this->buku->update($id, $data);

        $this->db->table('buku_rak')
            ->where('id_buku', $id)
            ->update(['id_rak' => $data['id_rak']]);
---
SELECT *
FROM `buku`
WHERE `buku`.`id_buku` = '53'