app/Controllers/Buku.php

SELECT COUNT(*) AS `numrows`
FROM `buku`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `buku`.`id_kategori`
LEFT JOIN `penulis` ON `penulis`.`id_penulis` = `buku`.`id_penulis`
LEFT JOIN `penerbit` ON `penerbit`.`id_penerbit` = `buku`.`id_penerbit`
LEFT JOIN `buku_rak` ON `buku_rak`.`id_buku` = `buku`.`id_buku`
LEFT JOIN `rak` ON `rak`.`id_rak` = `buku_rak`.`id_rak`
SELECT `buku`.*, `kategori`.`nama_kategori`, `penulis`.`nama_penulis`, `penerbit`.`nama_penerbit`, `rak`.`nama_rak`, `rak`.`lokasi`
FROM `buku`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `buku`.`id_kategori`
LEFT JOIN `penulis` ON `penulis`.`id_penulis` = `buku`.`id_penulis`
LEFT JOIN `penerbit` ON `penerbit`.`id_penerbit` = `buku`.`id_penerbit`
LEFT JOIN `buku_rak` ON `buku_rak`.`id_buku` = `buku`.`id_buku`
LEFT JOIN `rak` ON `rak`.`id_rak` = `buku_rak`.`id_rak`
WHERE `buku`.`judul` LIKE '%bandung%' ESCAPE '!'
SELECT *
FROM `penerbit`
SELECT *
FROM `penulis`
SELECT *
FROM `kategori`
---
    public function index()
    {
        $keyword  = $this->request->getGet('keyword');
        $kategori = $this->request->getGet('kategori');

        $builder = $this->bukuModel
            ->select('buku.*, kategori.nama_kategori, penulis.nama_penulis, penerbit.nama_penerbit, rak.nama_rak, rak.lokasi')
            ->join('kategori', 'kategori.id_kategori = buku.id_kategori', 'left')
            ->join('penulis', 'penulis.id_penulis = buku.id_penulis', 'left')
            ->join('penerbit', 'penerbit.id_penerbit = buku.id_penerbit', 'left')
            ->join('buku_rak', 'buku_rak.id_buku = buku.id_buku', 'left')
            ->join('rak', 'rak.id_rak = buku_rak.id_rak', 'left');

        if ($keyword) {
            $builder->like('buku.judul', $keyword);
        }

        if ($kategori) {
            $builder->where('buku.id_kategori', $kategori);
        }

        $data = [
            'buku'     => $builder->paginate(10),
            'pager'    => $this->bukuModel->pager,
            'kategori' => (new KategoriModel())->findAll()
        ];

SELECT *
FROM `kategori`
---
    public function create()
    {
        $data = [
            'kategori' => (new KategoriModel())->findAll(),
            'penulis'  => (new PenulisModel())->findAll(),
            'penerbit' => (new PenerbitModel())->findAll(),
            'rak'      => (new RakModel())->findAll(),
        ];

INSERT INTO `buku` (`judul`, `isbn`, `id_kategori`, `id_penulis`, `id_penerbit`, `tahun_terbit`, `jumlah`, `tersedia`, `deskripsi`, `cover`) VALUES ('dikta dan hukum', '123', '1', '1', '1', '2013', '5', '5', '12', '1777376432_714fef8f949817fc283c.htm')
---
    public function store()
    {
        $file = $this->request->getFile('cover');
        $cover = null;

        if ($file && $file->isValid() && !$file->hasMoved()) {
            $cover = $file->getRandomName();
            $file->move('uploads/buku', $cover);
        }

        $jumlah = (int) $this->request->getPost('jumlah');

        $data = [
            'isbn'         => $this->request->getPost('isbn'),
            'judul'        => $this->request->getPost('judul'),
            'id_kategori'  => $this->request->getPost('id_kategori'),
            'id_penulis'   => $this->request->getPost('id_penulis'),
            'id_penerbit'  => $this->request->getPost('id_penerbit'),
            'tahun_terbit' => $this->request->getPost('tahun_terbit'),
            'jumlah'       => $jumlah,
            'tersedia'     => $jumlah,
            'deskripsi'    => $this->request->getPost('deskripsi'),
            'cover'        => $cover
        ];

        // simpan buku
        $this->bukuModel->insert($data);