app/Controllers/Peminjaman.php

    public function create()
    {
        if (session()->get('role') != 'anggota') {
            return redirect()->to('/peminjaman')->with('error', 'Akses ditolak');
        }

        return view('peminjaman/create', [
            'buku' => $this->buku->findAll()
        ]);
---
SELECT *
FROM `buku`

    public function kembalikan($id)
    {
        $peminjaman = $this->peminjaman->find($id);

        if (!$peminjaman) {
            return redirect()->back()->with('error', 'Data tidak ditemukan');
        }

        $db = \Config\Database::connect();

        $tanggalKembali = date('Y-m-d');
        $jatuhTempo     = $peminjaman['tanggal_kembali'];

        $status = 'kembali';
        $denda  = 0;

        if (strtotime($tanggalKembali) > strtotime($jatuhTempo)) {
            $selisihHari = (strtotime($tanggalKembali) - strtotime($jatuhTempo)) / 86400;
            $denda = $selisihHari * 1000;
            $status = 'terlambat';
        }

        // simpan pengembalian
        $db->table('pengembalian')->insert([
            'id_peminjaman' => $id,
            'tanggal_dikembalikan' => $tanggalKembali,
            'denda' => $denda
        ]);

        // update status peminjaman
        $this->peminjaman->update($id, [
            'status' => $status
        ]);
---
INSERT INTO `pengembalian` (`id_peminjaman`, `tanggal_dikembalikan`, `denda`) VALUES ('63', '2026-04-21', 0)
UPDATE `peminjaman` SET `status` = 'kembali'
WHERE `peminjaman`.`id_peminjaman` IN ('63')

        $detail = $this->detail->where('id_peminjaman', $id)->findAll();

        foreach ($detail as $d) {
            $this->buku->set('tersedia', 'tersedia+1', false)
                ->where('id_buku', $d['id_buku'])
                ->update();
---
SELECT *
FROM `buku`
WHERE `buku`.`id_buku` = '14'
UPDATE `buku` SET `tersedia` = 6
WHERE `buku`.`id_buku` IN ('14')