app/Controllers/Peminjaman.php

    public function index()
    {
        $keyword = $this->request->getGet('search');

        $peminjaman = $this->peminjamanModel->getAll(
            $keyword,
            session()->get('id_anggota'),
            session()->get('role')
        );

        // ================= AMBIL BUKU =================
        foreach ($peminjaman as &$p) {
            $p['buku'] = $this->detailModel
                ->select('buku.judul')
                ->join('buku', 'buku.id_buku = detail_peminjaman.id_buku')
                ->where('detail_peminjaman.id_peminjaman', $p['id_peminjaman'])
                ->findAll();
---
SELECT `buku`.`judul`
FROM `detail_peminjaman`
JOIN `buku` ON `buku`.`id_buku` = `detail_peminjaman`.`id_buku`
WHERE `detail_peminjaman`.`id_peminjaman` = '50'

    public function create()
    {
        $data['buku'] = $this->bukuModel->findAll();
---
SELECT *
FROM `buku`

    public function detail($id)
    {
        $db = \Config\Database::connect(); // ✅ ini yang benar

        $builder = $db->table('peminjaman');

        $builder->select('peminjaman.*, anggota.user_id, petugas.user_id');
        $builder->join('anggota', 'anggota.id_anggota = peminjaman.id_anggota', 'left');
        $builder->join('petugas', 'petugas.id_petugas = peminjaman.id_petugas', 'left');
        $builder->where('peminjaman.id_peminjaman', $id);

        $data['peminjaman'] = $builder->get()->getRowArray();
---
SELECT *
FROM `peminjaman`
WHERE `peminjaman`.`id_peminjaman` = '105'

    public function perpanjang($id, $hari)
    {
        $data = $this->peminjamanModel->find($id);

        if (!$data) {
            return redirect()->to('/peminjaman')->with('error', 'Data tidak ditemukan');
        }

        $newDate = date('Y-m-d', strtotime($data['tanggal_kembali'] . " +$hari days"));

        $this->peminjamanModel->update($id, [
            'tanggal_kembali' => $newDate
        ]);
---
UPDATE `peminjaman` SET `tanggal_kembali` = '2026-05-07'
WHERE `peminjaman`.`id_peminjaman` IN ('105')