app/Controllers/Penerbit.php

    public function index()
    {
        $data['penerbit'] = $this->penerbit->findAll();
---
SELECT *
FROM `penerbit`