app/Controllers/pengembalian.php

SELECT `pengembalian`.*, `peminjaman`.`tanggal_pinjam`, `anggota`.`id_anggota`, `users`.`nama` as `nama_anggota`
FROM `pengembalian`
LEFT JOIN `peminjaman` ON `peminjaman`.`id_peminjaman` = `pengembalian`.`id_peminjaman`
LEFT JOIN `anggota` ON `anggota`.`id_anggota` = `peminjaman`.`id_anggota`
LEFT JOIN `users` ON `users`.`id` = `anggota`.`user_id`
---
    public function index()
    {
        $model = $this->pengembalianModel;

        $data['pengembalian'] = $model
            ->select('pengembalian.*, peminjaman.tanggal_pinjam,
                      anggota.id_anggota, users.nama as nama_anggota')
            ->join('peminjaman', 'peminjaman.id_peminjaman = pengembalian.id_peminjaman', 'left')
            ->join('anggota', 'anggota.id_anggota = peminjaman.id_anggota', 'left')
            ->join('users', 'users.id = anggota.user_id', 'left')
            ->findAll();