app/Controllers/Transaksi.php

    public function index()
    {
        $keyword = $this->request->getGet('keyword');

        $role = session()->get('role');
        $userId = session()->get('id_user');

        $builder = $this->transaksiModel->builder();

        $builder->select('
        transaksi.*,
        peminjaman.metode_pengantaran,
        peminjaman.ongkir,
        users.nama as nama_anggota
    ')
            ->join('peminjaman', 'peminjaman.id_peminjaman = transaksi.id_peminjaman')
            ->join('users', 'users.id = peminjaman.id_anggota');

        // 🔥 INI LOGIKA ROLE
        if ($role == 'anggota') {
            $builder->where('peminjaman.id_anggota', $userId);
        }

        if ($keyword) {
            $builder->groupStart()
                ->like('transaksi.status', $keyword)
                ->orLike('users.nama', $keyword)
                ->groupEnd();
        }

        $data['transaksi'] = $builder->get()->getResultArray();
---
SELECT `transaksi`.*, `peminjaman`.`metode_pengantaran`, `peminjaman`.`ongkir`, `users`.`nama` as `nama_anggota`
FROM `transaksi`
JOIN `peminjaman` ON `peminjaman`.`id_peminjaman` = `transaksi`.`id_peminjaman`
JOIN `users` ON `users`.`id` = `peminjaman`.`id_anggota`