app/Models/DetailPeminjamanModel.php

SELECT `buku`.`judul`, `buku`.`cover`
FROM `detail_peminjaman`
JOIN `buku` ON `buku`.`id_buku` = `detail_peminjaman`.`id_buku`
WHERE `id_peminjaman` = '139'
---
    public function getByPeminjaman($id_peminjaman)
    {
        return $this->db->table('detail_peminjaman')
            ->select('detail_peminjaman.*, buku.judul, buku.cover')
            ->join('buku', 'buku.id_buku = detail_peminjaman.id_buku')
            ->where('detail_peminjaman.id_peminjaman', $id_peminjaman)
            ->get()
            ->getResultArray();