app/Models/PeminjamanModel.php

    public function getAll()
    {
        return $this->db->table('peminjaman')
            ->select('
            peminjaman.*,
            u1.nama as nama_anggota,
            u2.nama as nama_petugas
        ')

            ->join('anggota', 'anggota.id_anggota = peminjaman.id_anggota', 'left')
            ->join('users as u1', 'u1.id = anggota.user_id', 'left')

            ->join('petugas', 'petugas.id_petugas = peminjaman.id_petugas', 'left')
            ->join('users as u2', 'u2.id = petugas.user_id', 'left')

            ->orderBy('peminjaman.id_peminjaman', 'DESC')
            ->get()->getResultArray();
---
SELECT `peminjaman`.*, `users`.`nama` AS `nama_anggota`
FROM `peminjaman`
JOIN `anggota` ON `anggota`.`id_anggota` = `peminjaman`.`id_anggota`
JOIN `users` ON `users`.`id` = `anggota`.`user_id`
ORDER BY `peminjaman`.`id_peminjaman` DESC

    public function getByAnggota($id_anggota)
    {
        return $this->db->table('peminjaman')
            ->select('
            peminjaman.*,
            u1.nama as nama_anggota,
            u2.nama as nama_petugas
        ')

            ->join('anggota', 'anggota.id_anggota = peminjaman.id_anggota', 'left')
            ->join('users as u1', 'u1.id = anggota.user_id', 'left')

            ->join('petugas', 'petugas.id_petugas = peminjaman.id_petugas', 'left')
            ->join('users as u2', 'u2.id = petugas.user_id', 'left')

            ->where('peminjaman.id_anggota', $id_anggota)
            ->orderBy('peminjaman.id_peminjaman', 'DESC')
            ->get()->getResultArray();
---
SELECT `peminjaman`.*, `u1`.`nama` as `nama_anggota`, `u2`.`nama` as `nama_petugas`
FROM `peminjaman`
LEFT JOIN `anggota` ON `anggota`.`id_anggota` = `peminjaman`.`id_anggota`
LEFT JOIN `users` as `u1` ON `u1`.`id` = `anggota`.`user_id`
LEFT JOIN `petugas` ON `petugas`.`id_petugas` = `peminjaman`.`id_petugas`
LEFT JOIN `users` as `u2` ON `u2`.`id` = `petugas`.`user_id`
WHERE `peminjaman`.`id_anggota` = '3'
ORDER BY `peminjaman`.`id_peminjaman` DESC