app/Models/PeminjamanModel.php

SELECT `peminjaman`.*, `anggota`.`user_id`
FROM `peminjaman`
JOIN `anggota` ON `anggota`.`id_anggota` = `peminjaman`.`id_anggota`
---
    public function getAll($keyword = null, $userId = null, $role = null)
    {
        $builder = $this->db->table('peminjaman');

        $builder->select('peminjaman.*, anggota.user_id');
        $builder->join('anggota', 'anggota.id_anggota = peminjaman.id_anggota');

        if ($role == 'anggota' && $userId) {
            $builder->where('peminjaman.id_anggota', $userId);
        }

        if ($keyword) {
            $builder->like('anggota.user_id', $keyword);
        }

        return $builder->get()->getResultArray();