app/Models/PenarikanModel.php

SELECT `penarikan`.*, `users`.`nama` as `nama_anggota`
FROM `penarikan`
JOIN `peminjaman` ON `peminjaman`.`id_peminjaman` = `penarikan`.`id_peminjaman`
JOIN `anggota` ON `anggota`.`id_anggota` = `peminjaman`.`id_anggota`
JOIN `users` ON `users`.`id` = `anggota`.`user_id`
---
    public function getPenarikan()
    {
        return $this->db->table('penarikan')
            ->select('penarikan.*, users.nama as nama_anggota')
            ->join('peminjaman', 'peminjaman.id_peminjaman = penarikan.id_peminjaman')
            ->join('anggota', 'anggota.id_anggota = peminjaman.id_anggota')
            ->join('users', 'users.id = anggota.user_id')
            ->get()
            ->getResultArray();